## 2. Dataframe

2d data (combine of series)

In [2]:
data = {
    "Name" : ["kim","James","Hoyoung"],
    "Region" : ["Seoul","Toronto","Vancouver"],
    "SW" : ["C", "Java", "Python"]
}

In [4]:
data

{'Name': ['kim', 'James', 'Hoyoung'],
 'Region': ['Seoul', 'Toronto', 'Vancouver'],
 'SW': ['C', 'Java', 'Python']}

In [6]:
data["Name"]

['kim', 'James', 'Hoyoung']

In [12]:
import pandas as pd
df = pd.DataFrame(data)
df

      Name     Region      SW
0      kim      Seoul       C
1    James    Toronto    Java
2  Hoyoung  Vancouver  Python

In [14]:
df["Name"]

0        kim
1      James
2    Hoyoung
Name: Name, dtype: object

In [16]:
df["Region"]

0        Seoul
1      Toronto
2    Vancouver
Name: Region, dtype: object

In [18]:
df[["Name","SW"]]

      Name      SW
0      kim       C
1    James    Java
2  Hoyoung  Python

# Index

In [20]:
df = pd.DataFrame(data, index=["No.1","No.2", "No.3"])
df

         Name     Region      SW
No.1      kim      Seoul       C
No.2    James    Toronto    Java
No.3  Hoyoung  Vancouver  Python

In [22]:
df = pd.DataFrame(data, columns=["Name","SW", "Region"])
df

      Name      SW     Region
0      kim       C      Seoul
1    James    Java    Toronto
2  Hoyoung  Python  Vancouver